//g++  5.4.0
// ამოცანა B.
// დადებით მთელ რიცხვ M-ს ვუწოდოთ დადებითი მთელი N რიცხვის თანაბარი
// გამყოფი, თუ N-ის M-ზე გაყოფისას განაყოფშიც და ნაშთშიც ერთი და იგივე რიცხვი
// მიიღება. მაგალითად, 10-თვის რიცხვი 4 წარმოადგენს თანაბარ გამყოფს. მოცემული
// დადებითი მთელი N-თვის დასადგენია მისი თანაბარი გამყოფების საერთო რაოდენობა.
// შეზღუდვები. 1<=N<=1012
// .

// შეტანის ფაილის ფორმატი. შეტანის ფაილში არის ერთადერთი რიცხვი N.
// გამოტანის ფაილის ფორმატი. ერთადერთ სტრიქონში — ამოცანის პასუხი.

// მაგალითები:
// შეტანის ფაილი    გამოტანის ფაილი
// 15               2
// 7236             12

#include <iostream>
using namespace std;

int main()
{
    long long number;
    int equalDivisor = 0;
    
    cin >> number;
    
    for (int current = 1; current <= number; current ++) 
    {
        equalDivisor += (number / current == number % current);
    }
    
    cout << equalDivisor << endl;
}
